In [26]:
import pandas as pd ; import numpy as np

# Aritmetik İşlemeler
## Toplama işlemi
### Açıklama:
- Aritmetik operatör kullanılarak yapılan işlemde eşleşmeyen indexdeki veriler NaN olarak işlem sonucuna yansır.
- .add metotu ile yapılan işlemlerde eşleşmeyen verilerin 0 olarak kabul edilmesini sağlayabilmek için "fill_value" parametresi verilir. Her iki taraftada bulunmuyan indexler NaN olarak yansır.
- Aritmetik işlemler için hazır fonksiyonlar sırası ile
    - Çıkarma için ```.sub```
    - Bölme için ```.div```
    - Çarpma için ```.mul```
    - Üst alma için ```.pow```
#### Series

In [27]:
s1 = pd.Series(np.arange(4), index=["a","c","d","e"])
s2 = pd.Series(np.arange(5), index=["a","c","e","f","g"])

In [28]:
s1

a    0
c    1
d    2
e    3
dtype: int32

In [29]:
s2

a    0
c    1
e    2
f    3
g    4
dtype: int32

In [30]:
s1 + s2

a    0.0
c    2.0
d    NaN
e    5.0
f    NaN
g    NaN
dtype: float64

### DataFrame

In [31]:
df1 = pd.DataFrame(np.arange(9).reshape(3,3), index=[1,2,3],
                   columns=list("ABC"))
df2 = pd.DataFrame(np.arange(16).reshape(4,4), index=[1,3,4,5],
                  columns=list("ACDE"))

In [32]:
df1

   A  B  C
1  0  1  2
2  3  4  5
3  6  7  8

In [33]:
df2

    A   C   D   E
1   0   1   2   3
3   4   5   6   7
4   8   9  10  11
5  12  13  14  15

In [34]:
df1 + df2

      A   B     C   D   E
1   0.0 NaN   3.0 NaN NaN
2   NaN NaN   NaN NaN NaN
3  10.0 NaN  13.0 NaN NaN
4   NaN NaN   NaN NaN NaN
5   NaN NaN   NaN NaN NaN

In [35]:
df1.add(df2)

      A   B     C   D   E
1   0.0 NaN   3.0 NaN NaN
2   NaN NaN   NaN NaN NaN
3  10.0 NaN  13.0 NaN NaN
4   NaN NaN   NaN NaN NaN
5   NaN NaN   NaN NaN NaN

In [36]:
df1.add(df2, fill_value = 0)

      A    B     C     D     E
1   0.0  1.0   3.0   2.0   3.0
2   3.0  4.0   5.0   NaN   NaN
3  10.0  7.0  13.0   6.0   7.0
4   8.0  NaN   9.0  10.0  11.0
5  12.0  NaN  13.0  14.0  15.0

## Artı bilgi

- Veri yapısının çarpma işlemine göre tersini almak için `1/df1` yapısı kullanılır.

In [37]:
1/df1

          A         B      C
1       inf  1.000000  0.500
2  0.333333  0.250000  0.200
3  0.166667  0.142857  0.125

## Çarpma işlemi
### Series

In [38]:
s1 * 3

a    0
c    3
d    6
e    9
dtype: int32

In [39]:
s1.mul(3)

a    0
c    3
d    6
e    9
dtype: int32

In [41]:
df1 * 3

    A   B   C
1   0   3   6
2   9  12  15
3  18  21  24

In [43]:
df1.mul(3)

    A   B   C
1   0   3   6
2   9  12  15
3  18  21  24

In [44]:
df1 * df2

      A   B     C   D   E
1   0.0 NaN   2.0 NaN NaN
2   NaN NaN   NaN NaN NaN
3  24.0 NaN  40.0 NaN NaN
4   NaN NaN   NaN NaN NaN
5   NaN NaN   NaN NaN NaN

In [46]:
df1.mul(df2, fill_value = 1)

      A    B     C     D     E
1   0.0  1.0   2.0   2.0   3.0
2   3.0  4.0   5.0   NaN   NaN
3  24.0  7.0  40.0   6.0   7.0
4   8.0  NaN   9.0  10.0  11.0
5  12.0  NaN  13.0  14.0  15.0

## DataFrame ve Series ile birlikte artimetik işlem yapmak

In [52]:
ss = df1.iloc[1]
ss

A    3
B    4
C    5
Name: 2, dtype: int32

In [54]:
df1

   A  B  C
1  0  1  2
2  3  4  5
3  6  7  8

In [57]:
df1 - ss

   A  B  C
1 -3 -3 -3
2  0  0  0
3  3  3  3

In [59]:
ss2 = df1["A"]
ss2

1    0
2    3
3    6
Name: A, dtype: int32

In [60]:
df1.sub(ss2, axis= "index")

   A  B  C
1  0  1  2
2  0  1  2
3  0  1  2


## Bir Numpy Fonksiyonunu Pandas Veri Yapısına Uygulamak

In [64]:
vs = pd.DataFrame(np.random.randn(4,4), columns=list("ABCD"),
                 index=["Arda","Berke","Ece","Ezgi"])
vs

              A         B         C         D
Arda  -1.032716  0.871985  0.186652  0.099028
Berke  0.304548 -1.511657  0.922224 -0.680138
Ece    0.454710  0.976844  0.058270  0.783929
Ezgi  -0.316937 -1.791169 -0.942299 -0.942270

In [65]:
np.abs(vs)

              A         B         C         D
Arda   1.032716  0.871985  0.186652  0.099028
Berke  0.304548  1.511657  0.922224  0.680138
Ece    0.454710  0.976844  0.058270  0.783929
Ezgi   0.316937  1.791169  0.942299  0.942270

## Oluşturulan Bir Fonksiyonu Pandas Veri Yapısına Uygulama
### Açıklama: 
- Oluşturulan fonksiyon herhangi bir satır veya stunda kullanılabilir. `.apply` metotu ile kullanılır.
- Varsayılan olarak stunlarda işleme alır. Satırlarda işlem yapmak için `.apply` metotuna `axis="colum"` ve `axis=1` parametresi verilir.

In [74]:
F = lambda x:np.abs(x.max() - x.min())/2 # yeni bir lambda fonksiyonu oluşturuldu

In [75]:
vs.apply(F)

A    0.743713
B    1.384007
C    0.932262
D    0.863099
dtype: float64

In [77]:
vs.apply(F, axis=1) # Yada "colum" parametresi

Arda     0.952351
Berke    1.216941
Ece      0.459287
Ezgi     0.737116
dtype: float64

In [79]:
def f(x):
    return x**2

In [80]:
vs.B.apply(f)

Arda     0.760359
Berke    2.285108
Ece      0.954225
Ezgi     3.208287
Name: B, dtype: float64

In [81]:
vs.A.apply(f)

Arda     1.066503
Berke    0.092750
Ece      0.206761
Ezgi     0.100449
Name: A, dtype: float64

In [82]:
vs.apply(f)

              A         B         C         D
Arda   1.066503  0.760359  0.034839  0.009807
Berke  0.092750  2.285108  0.850498  0.462588
Ece    0.206761  0.954225  0.003395  0.614544
Ezgi   0.100449  3.208287  0.887928  0.887872